app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2019-05-21 20:49:52.175524"], ["id", 7]]
---
    def update
        @todo = Todo.find(params[:id])

        if @todo.update(todo_params)